In [1]:
# Import all necessary libraries required for data analysis
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

In [2]:
# Read dataset
df=pd.read_csv('data_emission.csv')
df

            Entity Code  Year  Annual CO2 emissions (tonnes )
0      Afghanistan  AFG  1949                        14656.00
1      Afghanistan  AFG  1950                        84272.00
2      Afghanistan  AFG  1951                        91600.00
3      Afghanistan  AFG  1952                        91600.00
4      Afghanistan  AFG  1953                       106256.00
...            ...  ...   ...                             ...
20848     Zimbabwe  ZWE  2013                     11536239.29
20849     Zimbabwe  ZWE  2014                     11866348.41
20850     Zimbabwe  ZWE  2015                     10907603.94
20851     Zimbabwe  ZWE  2016                      9932649.88
20852     Zimbabwe  ZWE  2017                     10397718.47

[20853 rows x 4 columns]

In [3]:
df.head()

        Entity Code  Year  Annual CO2 emissions (tonnes )
0  Afghanistan  AFG  1949                         14656.0
1  Afghanistan  AFG  1950                         84272.0
2  Afghanistan  AFG  1951                         91600.0
3  Afghanistan  AFG  1952                         91600.0
4  Afghanistan  AFG  1953                        106256.0

# Understanding Dataset

In [4]:
df.shape

(20853, 4)

In [6]:
df['Entity'].value_counts()

Entity
Statistical differences      267
Asia and Pacific (other)     267
EU-28                        267
Europe (other)               267
Americas (other)             267
                            ...
Antarctic Fisheries           21
Wallis and Futuna Islands     17
Timor                         16
Christmas Island              14
Liechtenstein                 11
Name: count, Length: 233, dtype: int64

In [7]:
df['Year'].value_counts()

Year
2007    230
2002    229
2010    229
2003    229
2004    229
       ...
1775     13
1774     13
1773     13
1772     13
1752     13
Name: count, Length: 267, dtype: int64

In [9]:
df.nunique()

Entity                              233
Code                                222
Year                                267
Annual CO2 emissions (tonnes )    13092
dtype: int64

In [10]:
df.isnull().sum()

Entity                               0
Code                              2207
Year                                 0
Annual CO2 emissions (tonnes )       0
dtype: int64

In [11]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 20853 entries, 0 to 20852
Data columns (total 4 columns):
 #   Column                          Non-Null Count  Dtype
---  ------                          --------------  -----
 0   Entity                          20853 non-null  object
 1   Code                            18646 non-null  object
 2   Year                            20853 non-null  int64
 3   Annual CO2 emissions (tonnes )  20853 non-null  float64
dtypes: float64(1), int64(1), object(2)
memory usage: 651.8+ KB

In [12]:
df.drop('Code',axis='columns',inplace=True)

In [13]:
df

            Entity  Year  Annual CO2 emissions (tonnes )
0      Afghanistan  1949                        14656.00
1      Afghanistan  1950                        84272.00
2      Afghanistan  1951                        91600.00
3      Afghanistan  1952                        91600.00
4      Afghanistan  1953                       106256.00
...            ...   ...                             ...
20848     Zimbabwe  2013                     11536239.29
20849     Zimbabwe  2014                     11866348.41
20850     Zimbabwe  2015                     10907603.94
20851     Zimbabwe  2016                      9932649.88
20852     Zimbabwe  2017                     10397718.47

[20853 rows x 3 columns]

In [14]:
df=df.rename(columns={'Entity':'Country','Annual CO2 emissions (tonnes )':'Emission(tones)'})
df

           Country  Year  Emission(tones)
0      Afghanistan  1949         14656.00
1      Afghanistan  1950         84272.00
2      Afghanistan  1951         91600.00
3      Afghanistan  1952         91600.00
4      Afghanistan  1953        106256.00
...            ...   ...              ...
20848     Zimbabwe  2013      11536239.29
20849     Zimbabwe  2014      11866348.41
20850     Zimbabwe  2015      10907603.94
20851     Zimbabwe  2016       9932649.88
20852     Zimbabwe  2017      10397718.47

[20853 rows x 3 columns]

# Analysis of Data

In [15]:
df.head()

       Country  Year  Emission(tones)
0  Afghanistan  1949          14656.0
1  Afghanistan  1950          84272.0
2  Afghanistan  1951          91600.0
3  Afghanistan  1952          91600.0
4  Afghanistan  1953         106256.0

In [17]:
df.Year.min()

1751

In [18]:
df.Year.max()

2017